In [40]:
import numpy as np
import pandas as pd

In [41]:
df = pd.read_csv("/Users/armanshaikh/Desktop/pandas-fundamentals/practice_questions/practice7.csv")

In [42]:
df

,order_id,customer_id,order_date,product,category,price,quantity,city,payment_mode
0,1001,C101,2025-01-02,T-Shirt,Clothing,599,2,Delhi,UPI
1,1002,C102,2025-01-03,Shoes,Footwear,2499,1,Mumbai,Card
2,1003,C103,2025-01-03,Jeans,Clothing,1799,1,Bangalore,UPI
3,1004,C101,2025-01-04,Watch,Accessories,3299,1,Delhi,COD
4,1005,C104,2025-01-05,Headphones,Electronics,1999,2,Pune,UPI
5,1006,C105,2025-01-06,T-Shirt,Clothing,599,3,Delhi,Card
6,1007,C106,2025-01-06,Laptop,Electronics,65000,1,Hyderabad,Card
7,1008,C102,2025-01-07,Shoes,Footwear,2499,2,Mumbai,UPI
8,1009,C107,2025-01-08,Backpack,Accessories,1299,1,Chennai,COD
9,1010,C108,2025-01-09,Mobile,Electronics,22000,1,Delhi,UPI

In [43]:
# Load CSV and:
# Show first 10 rows


df[0:10]

,order_id,customer_id,order_date,product,category,price,quantity,city,payment_mode
0,1001,C101,2025-01-02,T-Shirt,Clothing,599,2,Delhi,UPI
1,1002,C102,2025-01-03,Shoes,Footwear,2499,1,Mumbai,Card
2,1003,C103,2025-01-03,Jeans,Clothing,1799,1,Bangalore,UPI
3,1004,C101,2025-01-04,Watch,Accessories,3299,1,Delhi,COD
4,1005,C104,2025-01-05,Headphones,Electronics,1999,2,Pune,UPI
5,1006,C105,2025-01-06,T-Shirt,Clothing,599,3,Delhi,Card
6,1007,C106,2025-01-06,Laptop,Electronics,65000,1,Hyderabad,Card
7,1008,C102,2025-01-07,Shoes,Footwear,2499,2,Mumbai,UPI
8,1009,C107,2025-01-08,Backpack,Accessories,1299,1,Chennai,COD
9,1010,C108,2025-01-09,Mobile,Electronics,22000,1,Delhi,UPI

In [44]:
# Show dataset shape
df.shape

(10, 9)

In [45]:
# Show column names
df.columns

Index(['order_id', 'customer_id', 'order_date', 'product', 'category', 'price',
       'quantity', 'city', 'payment_mode'],
      dtype='object')

In [46]:
# Total number of orders
total_orders = df.shape[0]
total_orders

10

In [47]:
#  Total revenue (price * quantity)
total_revenue = df["price"] * df["quantity"]
total_revenue.sum()

np.int64(107887)

In [48]:
unique_cities = df['city'].nunique()
unique_cities

6

In [49]:
# Unique product count
unique_product = df["product"].nunique()
unique_product

8

In [50]:
# Orders where city = "Delhi"
delhi_orders = df[df['city'] == "Delhi"]

In [51]:
delhi_orders

,order_id,customer_id,order_date,product,category,price,quantity,city,payment_mode
0,1001,C101,2025-01-02,T-Shirt,Clothing,599,2,Delhi,UPI
3,1004,C101,2025-01-04,Watch,Accessories,3299,1,Delhi,COD
5,1006,C105,2025-01-06,T-Shirt,Clothing,599,3,Delhi,Card
9,1010,C108,2025-01-09,Mobile,Electronics,22000,1,Delhi,UPI

In [52]:
# Orders where quantity > 3
orders_quantity_gt_3 = df[df['quantity'] > 3]
orders_quantity_gt_3

Empty DataFrame
Columns: [order_id, customer_id, order_date, product, category, price, quantity, city, payment_mode]
Index: []

In [54]:
# total_amount = price * quantity
df["total_amount"] =  df["price"] * df["quantity"]
df

,order_id,customer_id,order_date,product,category,price,quantity,city,payment_mode,total_amount
0,1001,C101,2025-01-02,T-Shirt,Clothing,599,2,Delhi,UPI,1198
1,1002,C102,2025-01-03,Shoes,Footwear,2499,1,Mumbai,Card,2499
2,1003,C103,2025-01-03,Jeans,Clothing,1799,1,Bangalore,UPI,1799
3,1004,C101,2025-01-04,Watch,Accessories,3299,1,Delhi,COD,3299
4,1005,C104,2025-01-05,Headphones,Electronics,1999,2,Pune,UPI,3998
5,1006,C105,2025-01-06,T-Shirt,Clothing,599,3,Delhi,Card,1797
6,1007,C106,2025-01-06,Laptop,Electronics,65000,1,Hyderabad,Card,65000
7,1008,C102,2025-01-07,Shoes,Footwear,2499,2,Mumbai,UPI,4998
8,1009,C107,2025-01-08,Backpack,Accessories,1299,1,Chennai,COD,1299
9,1010,C108,2025-01-09,Mobile,Electronics,22000,1,Delhi,UPI,22000

In [56]:
# Create numpy array of product prices â†’ find:

# Mean

# Median

# Standard deviation

arr = np.array(df["price"])
arr

array([  599,  2499,  1799,  3299,  1999,   599, 65000,  2499,  1299,
       22000])

In [57]:
arr.mean()

np.float64(10159.2)

In [59]:
np.median(arr)

np.float64(2249.0)

In [60]:
# Standard deviation
np.std(arr)

np.float64(19261.14576446583)

In [74]:
# Min sale day using pivot table
pd.pivot_table(df, values="total_amount", index="order_date", aggfunc="sum").idxmin()

total_amount    2025-01-02
dtype: object

In [73]:
df.loc[df['price'].idxmax()]

order_id               1007
customer_id            C106
order_date       2025-01-06
product              Laptop
category        Electronics
price                 65000
quantity                  1
city              Hyderabad
payment_mode           Card
total_amount          65000
Name: 6, dtype: object